In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    'city':['mumbai','delhi','banglore'],
    'temperature':[32,45,30],
    'humidity':[80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather = pd.DataFrame({
    'city':['new york','chicago','orlando'],
    'temperature':[21,14,35],
    'humidity':[68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
df = pd.concat([india_weather, us_weather],ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [7]:
df = pd.concat([india_weather, us_weather],keys=["india","US"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
US    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [8]:
df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [12]:
temprature_df = pd.DataFrame({
    'city':['mumbai','delhi','banglore'],
    'temperature':[32,45,30],
},index=[0,1,2])
temprature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [13]:
windspeed_df = pd.DataFrame({
    'city':['mumbai','delhi',],
    'windspeed':[7,12],
},index=[0,1])
windspeed_df

     city  windspeed
0  mumbai          7
1   delhi         12

In [15]:
pd.concat([temprature_df,windspeed_df],axis=1)

       city  temperature    city  windspeed
0    mumbai           32  mumbai        7.0
1     delhi           45   delhi       12.0
2  banglore           30     NaN        NaN

In [22]:
import pandas as pd
df1= pd.DataFrame({
    'city':['mumbai','delhi','banglore'],
    'temperature':[32,45,30],
})
df1

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [21]:
df2 = pd.DataFrame({
    'city':['new york','chicago','orlando'],
    'humidity':[68,65,75]
})
df2

       city  humidity
0  new york        68
1   chicago        65
2   orlando        75

In [27]:
c= pd.merge(df1,df2, on='city')
c

Empty DataFrame
Columns: [city, temperature, humidity]
Index: []